AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
#include "eth_upload.h"
#include "sensor_config.h"
#include "esp_log.h"
#include "nvs.h"
#include "esp_netif.h"
#include "esp_eth.h"
#include "esp_eth_mac_esp.h"
#include "esp_eth_phy.h"
#include "esp_event.h"
#include "esp_http_server.h"
#include "esp_http_client.h"
#include "esp_spiffs.h"
#include "esp_system.h"
#include "esp_random.h"
#include "esp_timer.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "lwip/ip4_addr.h"
#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include <sys/stat.h>
#include <string.h>
#include <stdio.h>
#include <math.h>

static const char *TAG = "ETH_UPLOAD";
static bool s_has_logo = false;
static char s_gw_str[16] = "";  // filled by eth_start_background(); "" = DHCP

#define WEB_PASSWORD       "999999"
#define SESSION_LIFETIME_S (12 * 3600)
static char    s_sess_token[33]  = {};   // 32 hex chars + null; empty = no session
static int64_t s_sess_expiry_us  = 0;   // esp_timer_get_time() at expiry

void eth_get_net_gw(char *out, size_t len)
{
    strncpy(out, s_gw_str, len);
    out[len - 1] = '\0';
}
static lv_obj_t *s_ip_label = NULL;
static lv_obj_t *s_qr_obj   = NULL;
static esp_eth_handle_t s_eth_handle = NULL;

#define ETH_PHY_POWER_GPIO  51
#define ETH_PHY_ADDR        1

// ── SPIFFS init ───────────────────────────────────────────────────────────────

void eth_upload_init(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path              = "/spiffs",
        .partition_label        = NULL,
        .max_files              = 5,
        .format_if_mount_failed = true
    };
    esp_err_t ret = esp_vfs_spiffs_register(&conf);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "SPIFFS mount failed: %s", esp_err_to_name(ret));
        s_has_logo = false;
        return;
    }
    struct stat st;
    s_has_logo = (stat(ETH_LOGO_SPIFFS, &st) == 0 && st.st_size > 0);
    ESP_LOGI(TAG, "SPIFFS mounted. Logo: %s (%ld bytes)",
             s_has_logo ? "found" : "not found",
             s_has_logo ? (long)st.st_size : 0L);
}

bool eth_upload_has_logo(void)
{
    return s_has_logo;
}

void eth_upload_clear_logo(void)
{
    // Mount SPIFFS if not already mounted, then delete the logo file
    esp_vfs_spiffs_conf_t conf = {
        .base_path              = "/spiffs",
        .partition_label        = NULL,
        .max_files              = 1,
        .format_if_mount_failed = false
    };
    esp_vfs_spiffs_register(&conf);   // ignore error if already mounted
    remove(ETH_LOGO_SPIFFS);
    remove(ETH_LOGO_HD_SPIFFS);
    s_has_logo = false;
    ESP_LOGW(TAG, "Logo cleared from SPIFFS");
}

// ── Session helpers ───────────────────────────────────────────────────────────

static void gen_session(void)
{
    for (int i = 0; i < 4; i++) {
        uint32_t r = esp_random();
        snprintf(s_sess_token + i * 8, 9, "%08x", (unsigned)r);
    }
    s_sess_expiry_us = esp_timer_get_time()
                       + (int64_t)SESSION_LIFETIME_S * 1000000LL;
    ESP_LOGI(TAG, "Session created, expires in %d h", SESSION_LIFETIME_S / 3600);
}

static bool is_authenticated(httpd_req_t *req)
{
    if (s_sess_token[0] == '\0' || esp_timer_get_time() > s_sess_expiry_us)
        return false;
    char cookie[128] = {};
    size_t clen = httpd_req_get_hdr_value_len(req, "Cookie");
    if (clen == 0 || clen >= sizeof(cookie)) return false;
    if (httpd_req_get_hdr_value_str(req, "Cookie", cookie, sizeof(cookie)) != ESP_OK)
        return false;
    char *p = strstr(cookie, "sess=");
    return (p && strncmp(p + 5, s_sess_token, 32) == 0);
}

static esp_err_t redirect_to_login(httpd_req_t *req)
{
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "/login");
    httpd_resp_send(req, NULL, 0);
    return ESP_OK;
}

// ── HTTP handlers ─────────────────────────────────────────────────────────────

static const char HTML_LOGIN[] =
"<!DOCTYPE html><html lang='en'><head>"
"<meta charset='utf-8'>"
"<meta name='viewport' content='width=device-width,initial-scale=1'>"
"<title>LIV24 Login</title><style>"
"body{background:#0a0a12;color:#eee;font-family:sans-serif;"
"max-width:320px;margin:80px auto;padding:20px;text-align:center}"
"h2{color:#00e5ff;margin:0 0 16px}"
"input{width:100%;padding:14px;background:#111;color:#eee;"
"border:1px solid #334455;border-radius:8px;font-size:22px;"
"letter-spacing:8px;text-align:center;box-sizing:border-box;margin:8px 0}"
"button{padding:14px 0;background:#00e5ff;color:#111;border:none;"
"border-radius:10px;font-size:16px;font-weight:bold;cursor:pointer;"
"width:100%;margin-top:8px}"
"#err{color:#ff4444;font-size:14px;margin-top:12px;min-height:20px}"
"</style></head><body>"
"<h2>LIV24 Setup</h2>"
"<p style='color:#556677'>Enter password to continue</p>"
"<form method='POST' action='/login'>"
"<input type='password' name='pass' maxlength='16' autofocus>"
"<button type='submit'>Unlock</button>"
"</form>"
"<div id='err'></div>"
"<script>if(location.search.indexOf('e=1')>=0)"
"document.getElementById('err').textContent='Incorrect password';</script>"
"</body></html>";

static const char HTML[] =
"<!DOCTYPE html>"
"<html lang='en'>"
"<head>"
"<meta charset='utf-8'>"
"<meta name='viewport' content='width=device-width,initial-scale=1'>"
"<title>LIV24 Setup</title>"
"<style>"
"body{background:#0a0a12;color:#eee;font-family:sans-serif;"
"max-width:420px;margin:40px auto;padding:20px;text-align:center}"
"h2{color:#00e5ff;margin:0 0 8px}"
"p{color:#556677;font-size:14px;margin:4px 0}"
"#zone{border:2px dashed #00e5ff;border-radius:16px;padding:36px 20px;"
"margin:20px 0;cursor:pointer;transition:background .2s}"
"#zone.on{background:#00e5ff18}"
"#preview{max-width:180px;max-height:180px;border-radius:12px;"
"display:none;margin:12px auto;border:2px solid #1a2a3a}"
"button{padding:14px 0;background:#00e5ff;color:#111;border:none;"
"border-radius:10px;font-size:16px;font-weight:bold;cursor:pointer;"
"width:100%;margin-top:8px}"
"button:disabled{background:#1a2a3a;color:#445566;cursor:default}"
"#st{margin-top:16px;min-height:22px;font-size:15px;color:#00cc44}"
"</style>"
"</head>"
"<body>"
"<h2>LIV24 Logo Setup</h2>"
"<p>Connected via <b style='color:#00ff88'>Ethernet</b> — upload your logo below.</p>"
"<p style='color:#334455;font-size:12px'>PNG or JPEG — browser resizes to 128×128 before upload</p>"
"<div id='zone' onclick=\"document.getElementById('f').click()\">"
"<p style='color:#445566'>Tap to choose image</p>"
"<input type='file' id='f' accept='image/*' style='display:none' onchange='picked(this)'>"
"</div>"
"<img id='preview' alt=''>"
"<button id='btn' disabled onclick='doUpload()'>Upload &amp; Restart</button>"
"<div id='st'></div>"
"<script>"
"var b48=null,b192=null;"
"function mkBlob(img,sz,cb){"
"  var c=document.createElement('canvas');c.width=sz;c.height=sz;"
"  var x=c.getContext('2d');"
"  x.fillStyle='#fff';x.fillRect(0,0,sz,sz);"
"  var s=Math.min(sz/img.width,sz/img.height);"
"  x.drawImage(img,(sz-img.width*s)/2,(sz-img.height*s)/2,img.width*s,img.height*s);"
"  c.toBlob(function(b){cb(b,c);},'image/jpeg',0.9);"
"}"
"function picked(inp){"
"  var file=inp.files[0];if(!file)return;"
"  var img=new Image();"
"  img.onload=function(){"
"    mkBlob(img,48,function(b){b48=b;"
"      mkBlob(img,192,function(b2,c){b192=b2;"
"        document.getElementById('preview').src=c.toDataURL();"
"        document.getElementById('preview').style.display='block';"
"        document.getElementById('zone').innerHTML='<p style=\\'color:#00e5ff\\'>'+file.name+'</p>';"
"        document.getElementById('btn').disabled=false;"
"      });"
"    });"
"  };"
"  img.src=URL.createObjectURL(file);"
"}"
"function doUpload(){"
"  if(!b48||!b192)return;"
"  var btn=document.getElementById('btn'),st=document.getElementById('st');"
"  btn.disabled=true;st.style.color='#00e5ff';st.innerText='Uploading...';"
"  fetch('/upload_hd',{method:'POST',headers:{'Content-Type':'image/jpeg'},body:b192})"
"  .then(function(){return fetch('/upload',{method:'POST',headers:{'Content-Type':'image/jpeg'},body:b48});})"
"  .then(function(r){return r.text();})"
"  .then(function(t){st.style.color='#00cc44';st.innerText=t;})"
"  .catch(function(e){st.style.color='#ff4444';st.innerText='Error: '+e;btn.disabled=false;});"
"}"
"</script>"
"<hr style='border:1px solid #1a2a3a;margin:28px 0'>"
"<h2>Sensor Config</h2>"
"<p>Choose which sensor is plugged into RS485</p>"
"<select id='sm' style='width:100%;padding:12px;background:#111;color:#eee;"
"border:1px solid #334455;border-radius:8px;font-size:15px;margin:8px 0'>"
"<option value='0'>SN-300BYH-M (PM/Temp/Hum/Sound)</option>"
"<option value='1'>CWT-EC/TDS (0-44000 uS/cm)</option>"
"<option value='2'>LD100 Leak Detector</option>"
"<option value='3'>CWT-TH04S (Temp/Hum)</option>"
"<option value='4'>BH-485-ORP (ORP+Temp)</option>"
"</select>"
"<div style='display:flex;align-items:center;gap:12px;margin:8px 0'>"
"<span style='color:#556677;font-size:14px;white-space:nowrap'>Slave ID</span>"
"<input type='number' id='sid' min='1' max='247' value='1'"
" style='flex:1;padding:10px;background:#111;color:#eee;"
"border:1px solid #334455;border-radius:8px;font-size:15px'>"
"</div>"
"<button onclick='saveSensor()'>Save Sensor Config</button>"
"<div id='sst' style='margin-top:10px;min-height:20px;font-size:14px;color:#00cc44'></div>"
"<script>"
"fetch('/sensor_info').then(function(r){return r.json();}).then(function(d){"
"  document.getElementById('sm').value=d.model;"
"  document.getElementById('sid').value=d.slave;"
"});"
"function saveSensor(){"
"  var m=document.getElementById('sm').value;"
"  var s=document.getElementById('sid').value;"
"  var ss=document.getElementById('sst');"
"  fetch('/sensor_cfg',{method:'POST',"
"    headers:{'Content-Type':'application/x-www-form-urlencoded'},"
"    body:'model='+m+'&slave='+s})"
"  .then(function(r){return r.text();})"
"  .then(function(t){ss.style.color='#00cc44';ss.innerText=t;})"
"  .catch(function(e){ss.style.color='#ff4444';ss.innerText='Error: '+e;});"
"}"
"</script>"
"<hr style='border:1px solid #1a2a3a;margin:20px 0'>"
"<button id='tbtn' onclick='testSensor()'"
" style='background:#0a2018;color:#00cc44;border:1px solid #00cc44'>Test Connection</button>"
"<div id='tst' style='margin-top:10px;font-size:13px;text-align:left;"
"background:#0a1a14;border-radius:8px;padding:10px;display:none;line-height:1.8'></div>"
"<script>"
"function testSensor(){"
"  var tst=document.getElementById('tst'),tb=document.getElementById('tbtn');"
"  tb.disabled=true;tst.style.display='block';tst.style.color='#aabbcc';tst.innerText='Testing...';"
"  fetch('/sensor_test').then(function(r){return r.json();}).then(function(d){"
"    tb.disabled=false;"
"    if(!d.ok){tst.innerHTML='<span style=\"color:#ff4444\">✗ '+d.error+'</span>';return;}"
"    var hdr='<span style=\"color:#00cc44\">✓ Sensor responded</span><br>'"
"      +'<span style=\"color:#778899\">'+d.model+' | Slave: '+d.slave+'</span><br>'"
"      +'<span style=\"color:#556677\">Raw: ['+d.regs.join(', ')+']</span><br>';"
"    if(d.ec!==undefined){"
"      tst.innerHTML=hdr+'EC: <b>'+d.ec+' uS/cm</b>';"
"    }else if(d.leak!==undefined){"
"      var sc=d.leak?'color:#ff4444':'color:#00cc44';"
"      tst.innerHTML=hdr+'Leak: <b style=\"'+sc+'\">'+d.status+'</b>';"
"    }else if(d.orp!==undefined){"
"      tst.innerHTML=hdr+'ORP: <b>'+d.orp+' mV</b>  Temp: <b>'+d.temp+'&deg;C</b>';"
"    }else{"
"      tst.innerHTML=hdr"
"        +'Temp: <b>'+d.temp+'&deg;C</b>  Hum: <b>'+d.hum+'%</b><br>'"
"        +'PM2.5: <b>'+d.pm25+'</b>  PM10: <b>'+d.pm10+'</b>  Sound: <b>'+d.sound+' dB</b>';"
"    }"
"  }).catch(function(e){tb.disabled=false;tst.innerHTML='<span style=\"color:#ff4444\">Error: '+e+'</span>';});"
"}"
"</script>"
"</body>"
"</html>";

static esp_err_t get_login_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_sendstr(req, HTML_LOGIN);
}

static esp_err_t post_login_handler(httpd_req_t *req)
{
    char body[64] = {};
    int len = httpd_req_recv(req, body, sizeof(body) - 1);
    if (len > 0) body[len] = '\0';

    char pass[32] = {};
    char *p = strstr(body, "pass=");
    if (p) {
        strncpy(pass, p + 5, sizeof(pass) - 1);
        char *end = strchr(pass, '&');
        if (end) *end = '\0';
    }

    if (strcmp(pass, WEB_PASSWORD) == 0) {
        gen_session();
        char cookie[96];
        snprintf(cookie, sizeof(cookie),
                 "sess=%s; Max-Age=%d; Path=/; HttpOnly",
                 s_sess_token, SESSION_LIFETIME_S);
        httpd_resp_set_status(req, "302 Found");
        httpd_resp_set_hdr(req, "Set-Cookie", cookie);
        httpd_resp_set_hdr(req, "Location", "/");
        httpd_resp_send(req, NULL, 0);
        ESP_LOGI(TAG, "Web login OK");
    } else {
        ESP_LOGW(TAG, "Web login failed (wrong password)");
        httpd_resp_set_status(req, "302 Found");
        httpd_resp_set_hdr(req, "Location", "/login?e=1");
        httpd_resp_send(req, NULL, 0);
    }
    return ESP_OK;
}

static esp_err_t get_root_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    httpd_resp_set_type(req, "text/html");
    return httpd_resp_send(req, HTML, HTTPD_RESP_USE_STRLEN);
}

