AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
static esp_err_t save_to_path(httpd_req_t *req, const char *path)
{
    const size_t MAX_SIZE = 512 * 1024;
    if (req->content_len == 0 || req->content_len > MAX_SIZE) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Bad size");
        return ESP_FAIL;
    }
    FILE *f = fopen(path, "wb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File open failed");
        return ESP_FAIL;
    }
    uint8_t buf[512];
    int remaining = (int)req->content_len;
    bool ok = true;
    while (remaining > 0) {
        int to_read = remaining < (int)sizeof(buf) ? remaining : (int)sizeof(buf);
        int received = httpd_req_recv(req, (char *)buf, to_read);
        if (received <= 0) { ok = false; break; }
        if (fwrite(buf, 1, received, f) != (size_t)received) { ok = false; break; }
        remaining -= received;
    }
    fclose(f);
    if (!ok) { remove(path); return ESP_FAIL; }
    return ESP_OK;
}

static esp_err_t post_upload_hd_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    if (save_to_path(req, ETH_LOGO_HD_SPIFFS) != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "HD upload failed");
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "logo_hd.jpg saved (%d bytes)", (int)req->content_len);
    httpd_resp_sendstr(req, "ok");
    return ESP_OK;
}

static esp_err_t post_upload_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    const size_t MAX_SIZE = 512 * 1024;

    if (req->content_len == 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty file");
        return ESP_FAIL;
    }
    if (req->content_len > MAX_SIZE) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File too large (max 512 KB)");
        return ESP_FAIL;
    }

    FILE *f = fopen(ETH_LOGO_SPIFFS, "wb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File open failed");
        return ESP_FAIL;
    }

    uint8_t buf[512];
    int remaining = (int)req->content_len;
    bool ok = true;

    while (remaining > 0) {
        int to_read = (remaining < (int)sizeof(buf)) ? remaining : (int)sizeof(buf);
        int received = httpd_req_recv(req, (char *)buf, to_read);
        if (received <= 0) { ok = false; break; }
        if (fwrite(buf, 1, received, f) != (size_t)received) { ok = false; break; }
        remaining -= received;
    }
    fclose(f);

    if (!ok) {
        remove(ETH_LOGO_SPIFFS);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload failed");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Logo saved (%d bytes). Restarting...", (int)req->content_len);
    httpd_resp_sendstr(req, "Logo uploaded! Restarting device...");
    vTaskDelay(pdMS_TO_TICKS(300));
    // Stop Ethernet DMA before reset — active EMAC DMA during SW_CPU_RESET
    // overwrites bootloader code in SRAM causing "Illegal instruction" crash.
    if (s_eth_handle) esp_eth_stop(s_eth_handle);
    vTaskDelay(pdMS_TO_TICKS(200));
    esp_restart();
    return ESP_OK;
}

// ── Sensor config handlers ────────────────────────────────────────────────────

static esp_err_t get_sensor_test_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    sensor_config_t      cfg = sensor_config_get();
    const sensor_model_t *m  = &SENSOR_MODELS[cfg.model_idx];
    sensor_last_raw_t    raw = sensor_get_raw();

    char json[320];
    if (!raw.valid) {
        snprintf(json, sizeof(json), "{\"ok\":false,\"error\":\"No reading yet\"}");
    } else {
        char regs_str[80] = "[";
        for (int i = 0; i < raw.count; i++) {
            char tmp[12];
            snprintf(tmp, sizeof(tmp), i < raw.count - 1 ? "%d," : "%d]", raw.regs[i]);
            strncat(regs_str, tmp, sizeof(regs_str) - strlen(regs_str) - 1);
        }

        if (m->type == SENSOR_TYPE_EC) {
            float ec = (m->idx_ec >= 0) ? raw.regs[m->idx_ec] / m->scale : NAN;
            char ecs[12];
            if (isnan(ec)) snprintf(ecs, sizeof(ecs), "null");
            else           snprintf(ecs, sizeof(ecs), "%.1f", ec);
            snprintf(json, sizeof(json),
                "{\"ok\":true,\"model\":\"%s\",\"slave\":%d,\"regs\":%s,\"ec\":%s}",
                m->name, cfg.slave_id, regs_str, ecs);

        } else if (m->type == SENSOR_TYPE_LEAK) {
            bool alarm = (m->idx_leak >= 0) ? (raw.regs[m->idx_leak] == 0x0002) : false;
            snprintf(json, sizeof(json),
                "{\"ok\":true,\"model\":\"%s\",\"slave\":%d,\"regs\":%s,"
                "\"leak\":%s,\"status\":\"%s\"}",
                m->name, cfg.slave_id, regs_str,
                alarm ? "true" : "false",
                alarm ? "ALARM" : "NORMAL");

        } else if (m->type == SENSOR_TYPE_ORP) {
            float orp  = (m->idx_orp  >= 0) ? (int16_t)raw.regs[m->idx_orp]  / m->scale : NAN;
            float temp = (m->idx_temp >= 0) ? (int16_t)raw.regs[m->idx_temp] / m->scale : NAN;
            char os[10], ts[8];
            if (isnan(orp))  snprintf(os, sizeof(os), "null"); else snprintf(os, sizeof(os), "%.1f", orp);
            if (isnan(temp)) snprintf(ts, sizeof(ts), "null"); else snprintf(ts, sizeof(ts), "%.1f", temp);
            snprintf(json, sizeof(json),
                "{\"ok\":true,\"model\":\"%s\",\"slave\":%d,\"regs\":%s,"
                "\"orp\":%s,\"temp\":%s}",
                m->name, cfg.slave_id, regs_str, os, ts);

        } else {
            float temp  = (m->idx_temp  >= 0) ? (int16_t)raw.regs[m->idx_temp] / m->scale : NAN;
            float hum   = (m->idx_hum   >= 0) ? raw.regs[m->idx_hum]           / m->scale : NAN;
            float pm10  = (m->idx_pm10  >= 0) ? raw.regs[m->idx_pm10]  / m->scale : NAN;
            float pm25  = (m->idx_pm25  >= 0) ? raw.regs[m->idx_pm25]  / m->scale : NAN;
            float sound = (m->idx_sound >= 0) ? (float)raw.regs[m->idx_sound]     : NAN;
            char ts[8], hs[8], p10s[8], p25s[8], ss[8];
            if (isnan(temp))  snprintf(ts,   sizeof(ts),   "null"); else snprintf(ts,   sizeof(ts),   "%.1f", temp);
            if (isnan(hum))   snprintf(hs,   sizeof(hs),   "null"); else snprintf(hs,   sizeof(hs),   "%.1f", hum);
            if (isnan(pm10))  snprintf(p10s, sizeof(p10s), "null"); else snprintf(p10s, sizeof(p10s), "%.1f", pm10);
            if (isnan(pm25))  snprintf(p25s, sizeof(p25s), "null"); else snprintf(p25s, sizeof(p25s), "%.1f", pm25);
            if (isnan(sound)) snprintf(ss,   sizeof(ss),   "null"); else snprintf(ss,   sizeof(ss),   "%.1f", sound);
            snprintf(json, sizeof(json),
                "{\"ok\":true,\"model\":\"%s\",\"slave\":%d,\"regs\":%s,"
                "\"temp\":%s,\"hum\":%s,\"pm10\":%s,\"pm25\":%s,\"sound\":%s}",
                m->name, cfg.slave_id, regs_str, ts, hs, p10s, p25s, ss);
        }
    }
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

