AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
    if (status != 200 || content_len <= 0 || content_len > 512 * 1024) {
        esp_http_client_cleanup(client);
        return false;
    }

    FILE *f = fopen(ETH_LOGO_SPIFFS, "wb");
    if (!f) { esp_http_client_cleanup(client); return false; }

    char buf[512];
    int total = 0, rlen;
    while ((rlen = esp_http_client_read(client, buf, sizeof(buf))) > 0) {
        fwrite(buf, 1, rlen, f);
        total += rlen;
    }
    fclose(f);
    esp_http_client_close(client);
    esp_http_client_cleanup(client);

    if (total < 10) { remove(ETH_LOGO_SPIFFS); return false; }

    s_has_logo = true;
    ESP_LOGI(TAG, "Logo saved: %d bytes → %s", total, ETH_LOGO_SPIFFS);
    return true;
}

void eth_start_background(void)
{
    ESP_LOGI(TAG, "Starting Ethernet (background / MQTT mode)...");
    // esp_netif_init() + esp_event_loop_create_default() called once in app_main.
    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);

    // Read network mode from NVS (written by DEV → Network tab)
    {
        char mode[8]     = "dhcp";
        char ip_str[16]  = "";
        char mask_str[16] = "";
        nvs_handle_t h;
        if (nvs_open("eth_cfg", NVS_READONLY, &h) == ESP_OK) {
            size_t len;
            len = sizeof(mode);      nvs_get_str(h, "mode", mode,      &len);
            len = sizeof(ip_str);    nvs_get_str(h, "ip",   ip_str,    &len);
            len = sizeof(mask_str);  nvs_get_str(h, "mask", mask_str,  &len);
            nvs_close(h);
        }

        if (strcmp(mode, "static") == 0 && ip_str[0]) {
            // Derive gateway: same first 3 octets, last octet = 1
            uint8_t o[4] = {192, 168, 1, 1};
            sscanf(ip_str, "%hhu.%hhu.%hhu.%hhu", &o[0], &o[1], &o[2], &o[3]);
            snprintf(s_gw_str, sizeof(s_gw_str), "%d.%d.%d.1", o[0], o[1], o[2]);

            esp_netif_dhcpc_stop(eth_netif);
            esp_netif_ip_info_t ip_info = {};
            ip4addr_aton(ip_str,    (ip4_addr_t *)&ip_info.ip);
            ip4addr_aton(mask_str[0] ? mask_str : "255.255.255.0",
                         (ip4_addr_t *)&ip_info.netmask);
            ip4addr_aton(s_gw_str,  (ip4_addr_t *)&ip_info.gw);
            ESP_ERROR_CHECK(esp_netif_set_ip_info(eth_netif, &ip_info));
            ESP_LOGI(TAG, "Static IP: %s  mask %s  gw %s", ip_str, mask_str, s_gw_str);
        } else {
            s_gw_str[0] = '\0';
            ESP_LOGI(TAG, "Ethernet started — waiting for DHCP lease...");
        }
    }

    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT, ESP_EVENT_ANY_ID,
                                               eth_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_ETH_GOT_IP,
                                               eth_event_handler, NULL));
    eth_hw_start(eth_netif);
    start_http_server();
}

// ── Setup-mode Ethernet + HTTP upload server ──────────────────────────────────

void eth_upload_start(lv_obj_t *qr_obj, lv_obj_t *ip_label)
{
    s_ip_label = ip_label;
    s_qr_obj   = qr_obj;
    ESP_LOGI(TAG, "Starting Ethernet (upload mode)...");
    // esp_netif_init() + esp_event_loop_create_default() called once in app_main.

    esp_netif_config_t netif_cfg = ESP_NETIF_DEFAULT_ETH();
    esp_netif_t *eth_netif = esp_netif_new(&netif_cfg);

    ESP_ERROR_CHECK(esp_event_handler_register(ETH_EVENT,  ESP_EVENT_ANY_ID,    eth_event_handler, NULL));
    ESP_ERROR_CHECK(esp_event_handler_register(IP_EVENT,   IP_EVENT_ETH_GOT_IP, eth_event_handler, NULL));

    eth_hw_start(eth_netif);

    ESP_LOGI(TAG, "Ethernet started — waiting for IP (DHCP)...");

    start_http_server();

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}
